src/Reports/ОтчетПоВыработкеНаСтендеДДСводный/ОтчетПоВыработкеНаСтендеДДСводный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоВыработкеНаСтендеДДСводный</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/СтендовыйПрогон/СтендовыйПрогон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтендовыйПрогон</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Прогон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПоступление</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПостановка</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПостановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительСнятие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСнятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/РемонтнаяКарта/РемонтнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РемонтнаяКарта</name>
  <basedOn>Document.ПроизводственноеЗадание</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеремонтопригодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРемонта</name>
    <type>
      <types>CatalogRef.ПричиныРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоРазукомплектовки</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтложен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Неисправности</name>
    <attributes>
      <name>ПозицияНеисправногоМПЗ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеисправныйМПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияМестаНахожденияБрака</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоНахожденияБрака</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапЖизненногоЦикла</name>
      <type>
        <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидБрака</name>
      <type>
        <types>CatalogRef.ВидыБрака</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаменяемыеЭлементы</name>
    <attributes>
      <name>НормаРасхода</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДвижениеМПЗ</types>
        <types>DocumentRef.СписаниеМПЗПрочее</types>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разукомплектовка</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/РабочиеМестаЛинеек/РабочиеМестаЛинеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМестаЛинеек</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Авторизовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗаданийПоВремениПоступления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРабочихМест</name>
    <type>
      <types>CatalogRef.ГруппыРабочихМест</types>
    </type>
  </attributes>
  <attributes>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированиемВТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаканчиватьПредыдущийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводIMEI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводMACАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводКодDanfoss</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводBT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБуфер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнитьТехОснастку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчетПоВыработкеНаСтендеДДСводный/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КоличествоВ = 1;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
СписокРабочихМестСтенд.Очистить();
Запрос = Новый Запрос;
ТаблицаСП = Новый ТаблицаЗначений;

ТаблицаСП.Колонки.Добавить("Линейка",Новый ОписаниеТипов("СправочникСсылка.Линейки"));
ТаблицаСП.Колонки.Добавить("Исполнитель",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
ТаблицаСП.Колонки.Добавить("КолПоставлено",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаСП.Колонки.Добавить("КолСнято",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаСП.Колонки.Добавить("КолРемонт",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаСП.Колонки.Добавить("КолВторичныйПрогон",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И РабочиеМестаЛинеек.ГруппаРабочихМест.Наименование ПОДОБНО &Наименование";
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
Запрос.УстановитьПараметр("Наименование", "СТ%");
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРабочихМестСтенд.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
 
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
ОблИсполнительИтого = Макет.ПолучитьОбласть("ИсполнительИтого");
ОблЛинейка = Макет.ПолучитьОбласть("Линейка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтендовыйПрогон.ИсполнительПоступление,
	|	СтендовыйПрогон.ДатаПоступления,
	|	СтендовыйПрогон.Прогон,
	|	СтендовыйПрогон.Изделие,
	|	СтендовыйПрогон.ПЗ.Линейка КАК Линейка
	|ИЗ
	|	РегистрСведений.СтендовыйПрогон КАК СтендовыйПрогон
	|ГДЕ
	|	СтендовыйПрогон.ПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И СтендовыйПрогон.ДатаПоступления МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И СтендовыйПрогон.ИсполнительПоступление = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	КонецЕсли; 	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Линейка;
	ТЧ.Исполнитель = Выборка.ИсполнительПоступление;
		Если Выборка.Прогон > 1 Тогда
			Если КоличествоВ = 1 Тогда
			ТЧ.КолВторичныйПрогон = 1;				
			Иначе
			ТЧ.КолВторичныйПрогон = Выборка.Изделие.УсловныеПриборы;
			КонецЕсли;				
		КонецЕсли; 
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтендовыйПрогон.Изделие,
	|	СтендовыйПрогон.ПЗ.Линейка КАК Линейка,
	|	СтендовыйПрогон.ИсполнительПостановка,
	|	СтендовыйПрогон.ДатаПостановки
	|ИЗ
	|	РегистрСведений.СтендовыйПрогон КАК СтендовыйПрогон
	|ГДЕ
	|	СтендовыйПрогон.ПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И СтендовыйПрогон.ДатаПостановки МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И СтендовыйПрогон.ИсполнительПостановка = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	КонецЕсли;	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Линейка;
	ТЧ.Исполнитель = Выборка.ИсполнительПостановка;
		Если КоличествоВ = 1 Тогда
		ТЧ.КолПоставлено = 1;				
		Иначе
		ТЧ.КолПоставлено = Выборка.Изделие.УсловныеПриборы;
		КонецЕсли; 
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтендовыйПрогон.Изделие,
	|	СтендовыйПрогон.ПЗ.Линейка КАК Линейка,
	|	СтендовыйПрогон.ИсполнительСнятие,
	|	СтендовыйПрогон.ДатаСнятия
	|ИЗ
	|	РегистрСведений.СтендовыйПрогон КАК СтендовыйПрогон
	|ГДЕ
	|	СтендовыйПрогон.ПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И СтендовыйПрогон.ДатаСнятия МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И СтендовыйПрогон.ИсполнительСнятие = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	КонецЕсли;	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Линейка;
	ТЧ.Исполнитель = Выборка.ИсполнительСнятие;
		Если КоличествоВ = 1 Тогда
		ТЧ.КолСнято = 1;				
		Иначе
		ТЧ.КолСнято = Выборка.Изделие.УсловныеПриборы;
		КонецЕсли; 
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РемонтнаяКарта.Ссылка,
	|	РемонтнаяКарта.ДокументОснование.Изделие КАК Изделие,
	|	РемонтнаяКарта.РабочееМесто.Стенд.Исполнитель КАК Исполнитель
	|ИЗ
	|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
	|ГДЕ
	|	РемонтнаяКарта.РабочееМесто В(&СписокРабочихМестСтенд)
	|	И РемонтнаяКарта.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.РабочееМесто.Стенд.Исполнитель = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	КонецЕсли;	
Запрос.УстановитьПараметр("СписокРабочихМестСтенд",СписокРабочихМестСтенд);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Ссылка.Линейка;
	ТЧ.Исполнитель = Выборка.Исполнитель;
		Если КоличествоВ = 1 Тогда
		ТЧ.КолРемонт = 1;				
		Иначе
		ТЧ.КолРемонт = Выборка.Изделие.УсловныеПриборы;
		КонецЕсли; 
	КонецЦикла;
ТаблицаСП.Свернуть("Исполнитель,Линейка","КолПоставлено,КолСнято,КолРемонт,КолВторичныйПрогон"); 
ТаблицаСП.Сортировать("Исполнитель,Линейка");
ТекИсполнитель = "";
КолПоставленоИсполнитель = 0;
КолСнятоИсполнитель = 0;
КолРемонтИсполнитель = 0;	
КолВторичныйПрогонИсполнитель = 0;
	Для каждого ТЧ Из ТаблицаСП Цикл
	КолПоставлено = ТЧ.КолПоставлено;
	КолСнято = ТЧ.КолСнято;
	КолРемонт = ТЧ.КолРемонт;	
	КолВторичныйПрогон = ТЧ.КолВторичныйПрогон;
		Если ТекИсполнитель <> ТЧ.Исполнитель Тогда
			Если ТекИсполнитель <> "" Тогда
			ОблИсполнительИтого.Параметры.КолПоставлено = КолПоставленоИсполнитель;
			ОблИсполнительИтого.Параметры.КолСнято = КолСнятоИсполнитель;
			ОблИсполнительИтого.Параметры.КолРемонт = КолРемонтИсполнитель;
			ОблИсполнительИтого.Параметры.КолВторичныйПрогон = КолВторичныйПрогонИсполнитель;
			ТабДок.Вывести(ОблИсполнительИтого);
			КонецЕсли;
		ОблИсполнитель.Параметры.Исполнитель = СокрЛП(ТЧ.Исполнитель.Наименование);
		ТабДок.Вывести(ОблИсполнитель);
		КолПоставленоИсполнитель = 0;
		КолСнятоИсполнитель = 0;
		КолРемонтИсполнитель = 0;	
		КолВторичныйПрогонИсполнитель = 0;
		ТекИсполнитель = ТЧ.Исполнитель;
		КонецЕсли;
	ОблЛинейка.Параметры.Линейка = ""+ТЧ.Линейка + " ("+ТЧ.Линейка.Комментарий+")";
	ОблЛинейка.Параметры.КолПоставлено = КолПоставлено;
	ОблЛинейка.Параметры.КолСнято = КолСнято;
	ОблЛинейка.Параметры.КолРемонт = КолРемонт;
	ОблЛинейка.Параметры.КолВторичныйПрогон = КолВторичныйПрогон;
	ТабДок.Вывести(ОблЛинейка);			
	КолПоставленоИсполнитель = КолПоставленоИсполнитель+КолПоставлено;
	КолСнятоИсполнитель = КолСнятоИсполнитель+КолСнято;
	КолРемонтИсполнитель = КолРемонтИсполнитель+КолРемонт;	
	КолВторичныйПрогонИсполнитель = КолВторичныйПрогонИсполнитель+КолВторичныйПрогон; 
	КонецЦикла;
ОблИсполнительИтого.Параметры.КолПоставлено = КолПоставленоИсполнитель;
ОблИсполнительИтого.Параметры.КолСнято = КолСнятоИсполнитель;
ОблИсполнительИтого.Параметры.КолРемонт = КолРемонтИсполнитель;
ОблИсполнительИтого.Параметры.КолВторичныйПрогон = КолВторичныйПрогонИсполнитель;
ТабДок.Вывести(ОблИсполнительИтого);
ОблКонец.Параметры.КолПоставленоВсего = ТаблицаСП.Итог("КолПоставлено");
ОблКонец.Параметры.КолСнятоВсего = ТаблицаСП.Итог("КолСнято");
ОблКонец.Параметры.КолРемонтВсего = ТаблицаСП.Итог("КолРемонт");
ОблКонец.Параметры.КолВторичныйПрогонВсего = ТаблицаСП.Итог("КолВторичныйПрогон");
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
